/* eslint-disable import/prefer-default-export */
const scrum = 'Для того чтобы использование Scrum-а было оправдано, необходимо соблюдение ряда условий. ' +
'Прежде всего у команды проекта должно быть поле для экспериментов и исследований, иначе нет смысла работать по методологии,' +
'которая предполагает, что у проекта нет точного плана и алгоритма выполнения работ.' +
'Для Scrum необходим высокий уровень развития Agile культуры в команде и организации, в противном случае использование подхода принесет только убытки.' +
'Более того, стоит учитывать, что Scrum – метод, предполагающий непрерывную и интенсивную работу, что требует высоких затрат человеческой энергии,' +
'и поэтому может приводить к выгоранию и потере ключевых сотрудников.';

const fdd = 'Методологию FDD можно считать переходным этапом от традиционных методов к Agile-подходам. ' +
'Она сочетает принципы традиционных подходов (заблаговременное планирование) с гибкими практиками (итеративная и поэтапная поставка продукта,' +
'ориентация на ценность бизнеса для клиента и конечного пользователя). ' +
'Данная методология может быть полезна, когда внедрение более гибких методов затруднено на предприятии с нисходящей структурой управления. ' +
'В отличие от Scrum-а FDD дает возможность управлять проектами со значительно большим числом участников, задействовать менее квалифицированных разработчиков и разрабатывать проекты критически важных систем.';

const dsdm = 'Методология DSDM решает проблемы, связанные как с гибкой разработкой, так и с традиционными подходами.' +
'В частности, DSDM требует, чтобы основные требования проекта были согласованы на ранней стадии, что позволяет предприятиям понять масштабы и основные характеристики предлагаемого решения до начала разработки.' +
'С другой стороны, в DSDM итеративный подход поощряет появление деталей с течением времени.' +
'Любой недостаток в деталях реализации может быть устранен на последующей итерации разработки.' +
'Это может быть полезно, так как бизнес-требования со временем могут измениться на уровне детализации продукта.';

export { scrum, fdd, dsdm };
