/* eslint-disable import/prefer-default-export */
const agile = 'Agile — это группа методик для гибкого управления проектами в команде разработки.' +
' Рабочий процесс при таком подходе разбивается на небольшие временные промежутки, их еще называют спринтами (от английского sprint — бег на короткую дистанцию) или итерациями.' +
'Во время каждого спринта команда разработки создает часть продукта, которую можно протестировать и оценить.' +
'Такой подход позволяет вносить существенные изменения в проект, даже когда разработка в самом разгаре.';

const waterfall = 'Waterfall — модель «Водопад», водопадная или каскадная разработка продуктов.' +
'Она подобно потоку воды направляет команды решать задачи последовательно и строго по изначальному плану.' +
'Классическая методология Waterfall — это работа по заранее написанному и согласованному ТЗ.' +
'Гибкость здесь не приветствуется. Бывают проекты, которым она подходит, — такие,' +
'в которых все требования известны заранее и не могут измениться по ходу работы и где нет риска ошибиться.';

export { agile, waterfall };
